## Period and Period Index

In [1]:
import pandas as pd

y = pd.Period('2019')      
y                          # A-DEC : is anually - ending December

Period('2019', 'A-DEC')

In [2]:
m = pd.Period('2019-01', freq='M')    # 'M' monthly TimePeriod, we can create weekly, hourly also
m

Period('2019-01', 'M')

In [3]:
# we can also perform - Arithmetic
           
m + 1      # increase month

Period('2019-02', 'M')

In [4]:
d = pd.Period('2017-02-28', freq='D')     # creating daily time Period
d
d+1

Period('2017-03-01', 'D')

In [5]:
d+pd.offsets.Day(2)              # similarly for -> Hour(5)

Period('2017-03-02', 'D')

In [6]:
q = pd.Period('2017Q1')        # quarterly
q                              # we can increase  q+1

Period('2017Q1', 'Q-DEC')

## ----------------

### Many companies have different --fiscal year  , fiscal year is not align with calender year like : Walmart - fiscal year is Feb to Jan

In [7]:
q = pd.Period('2017Q1', freq='Q-JAN')     # for Walmart , freq='Q-jan' means fiscal year ending in Jan
q

Period('2017Q1', 'Q-JAN')

In [8]:
q.start_time          # we can verify by checking start_time , end_time

Timestamp('2016-02-01 00:00:00')

In [9]:
# we can convert quarterly into monthly freq

q.asfreq('M', how='start')       # how=' ' specify from start time

Period('2016-02', 'M')

In [10]:
q2 = pd.Period('2018Q2', freq='Q-JAN')
q2

Period('2018Q2', 'Q-JAN')

In [11]:
q2 - q       # difference of quarterly

In [12]:
# Now we creating Period range

idx = pd.period_range('2011','2017', freq='Q-JAN')      # Q-JAN : ending in Jan , for Walmart
idx                                                    

# We can also create number of (periods=10) , inplace of (not giving 2017)

PeriodIndex(['2011Q4', '2012Q1', '2012Q2', '2012Q3', '2012Q4', '2013Q1',
             '2013Q2', '2013Q3', '2013Q4', '2014Q1', '2014Q2', '2014Q3',
             '2014Q4', '2015Q1', '2015Q2', '2015Q3', '2015Q4', '2016Q1',
             '2016Q2', '2016Q3', '2016Q4', '2017Q1', '2017Q2', '2017Q3',
             '2017Q4'],
            dtype='period[Q-JAN]', freq='Q-JAN')

In [13]:
# Jan 2011- converted into fiscal Q4
idx[0].start_time

Timestamp('2010-11-01 00:00:00')

In [14]:
idx[0].end_time

Timestamp('2011-01-31 23:59:59.999999999')

In [15]:
import numpy as np                                       # we can also create Series
 
ps = pd.Series(np.random.randn(len(idx)), idx)
ps.head()

2011Q4    0.594087
2012Q1   -2.243017
2012Q2   -0.186556
2012Q3    1.479010
2012Q4    1.832912
Freq: Q-JAN, dtype: float64

In [16]:
ps.index

PeriodIndex(['2011Q4', '2012Q1', '2012Q2', '2012Q3', '2012Q4', '2013Q1',
             '2013Q2', '2013Q3', '2013Q4', '2014Q1', '2014Q2', '2014Q3',
             '2014Q4', '2015Q1', '2015Q2', '2015Q3', '2015Q4', '2016Q1',
             '2016Q2', '2016Q3', '2016Q4', '2017Q1', '2017Q2', '2017Q3',
             '2017Q4'],
            dtype='period[Q-JAN]', freq='Q-JAN')

In [17]:
# we can convert Period index -- into Datetime index

pst = ps.to_timestamp()
pst.head()

2010-11-01    0.594087
2011-02-01   -2.243017
2011-05-01   -0.186556
2011-08-01    1.479010
2011-11-01    1.832912
Freq: QS-NOV, dtype: float64

In [18]:
pst.index

DatetimeIndex(['2010-11-01', '2011-02-01', '2011-05-01', '2011-08-01',
               '2011-11-01', '2012-02-01', '2012-05-01', '2012-08-01',
               '2012-11-01', '2013-02-01', '2013-05-01', '2013-08-01',
               '2013-11-01', '2014-02-01', '2014-05-01', '2014-08-01',
               '2014-11-01', '2015-02-01', '2015-05-01', '2015-08-01',
               '2015-11-01', '2016-02-01', '2016-05-01', '2016-08-01',
               '2016-11-01'],
              dtype='datetime64[ns]', freq='QS-NOV')

In [19]:
# we can convert  Datetime index  back to Period Time index

pst.to_period().head()

2010Q4    0.594087
2011Q1   -2.243017
2011Q2   -0.186556
2011Q3    1.479010
2011Q4    1.832912
Freq: Q-DEC, dtype: float64

## --------------------------

In [20]:
import pandas as pd

df = pd.read_csv("wmt.csv")
df

  Line Item  2017Q1  2017Q2  2017Q3  2017Q4  2018Q1
0   Revenue  115904  120854  118179  130936  117542
1  Expenses   86544   89485   87484   97743   87688
2    Profit   29360   31369   30695   33193   29854

In [21]:
df.set_index('Line Item', inplace=True)
df

           2017Q1  2017Q2  2017Q3  2017Q4  2018Q1
Line Item
Revenue    115904  120854  118179  130936  117542
Expenses    86544   89485   87484   97743   87688
Profit      29360   31369   30695   33193   29854

In [22]:
df = df.T        # Transpose - row into column and vice-versa
df

Line Item  Revenue  Expenses  Profit
2017Q1      115904     86544   29360
2017Q2      120854     89485   31369
2017Q3      118179     87484   30695
2017Q4      130936     97743   33193
2018Q1      117542     87688   29854

In [23]:
# Here we convert type index into PeriodIndex type

df.index = pd.PeriodIndex(df.index, freq='Q-JAN')
df.index

PeriodIndex(['2017Q1', '2017Q2', '2017Q3', '2017Q4', '2018Q1'], dtype='period[Q-JAN]', freq='Q-JAN')

In [24]:
# Now we create a column 

df['start date'] = df.index.map(lambda x: x.start_time)
df

Line Item  Revenue  Expenses  Profit start date
2017Q1      115904     86544   29360 2016-02-01
2017Q2      120854     89485   31369 2016-05-01
2017Q3      118179     87484   30695 2016-08-01
2017Q4      130936     97743   33193 2016-11-01
2018Q1      117542     87688   29854 2017-02-01

In [25]:
df['end date'] = df.index.map(lambda x: x.start_time)
df

Line Item  Revenue  Expenses  Profit start date   end date
2017Q1      115904     86544   29360 2016-02-01 2016-02-01
2017Q2      120854     89485   31369 2016-05-01 2016-05-01
2017Q3      118179     87484   30695 2016-08-01 2016-08-01
2017Q4      130936     97743   33193 2016-11-01 2016-11-01
2018Q1      117542     87688   29854 2017-02-01 2017-02-01

## ------------------------

#   Timezone Handling

In [26]:
import pandas as pd

df = pd.read_csv('msft.csv', index_col='Date Time', header=1, parse_dates=True)
df

                     Price
Date Time
2017-08-17 09:00:00  72.38
2017-08-17 09:15:00  71.00
2017-08-17 09:30:00  71.67
2017-08-17 10:00:00  72.80
2017-08-17 10:30:00  73.00
2017-08-17 11:00:00  72.50

#### Two types of DateTime Objects in Python,                                                                                                                                   
1. Naive (No timezone awareness)                                                                                       
2. Time zone aware datetime

In [27]:
df.index         # this dtype shows Naive datetime , we will convert into Time zone aware datetime

DatetimeIndex(['2017-08-17 09:00:00', '2017-08-17 09:15:00',
               '2017-08-17 09:30:00', '2017-08-17 10:00:00',
               '2017-08-17 10:30:00', '2017-08-17 11:00:00'],
              dtype='datetime64[ns]', name='Date Time', freq=None)

In [28]:
df = df.tz_localize(tz='US/Eastern')        # this data coming from newyork and we converting it to US zone, utcsimilar to GMT
df.index                                   # it showing 9:00-4 bcoz US behind 4 hrs acc. to utc(universal cordinated timezone)

DatetimeIndex(['2017-08-17 09:00:00-04:00', '2017-08-17 09:15:00-04:00',
               '2017-08-17 09:30:00-04:00', '2017-08-17 10:00:00-04:00',
               '2017-08-17 10:30:00-04:00', '2017-08-17 11:00:00-04:00'],
              dtype='datetime64[ns, US/Eastern]', name='Date Time', freq=None)

In [29]:
# converting this timezone into -> Berlin timezone

df = df.tz_convert(tz='Europe/Berlin')       # +2 shows bcoz UTC+2
df

                           Price
Date Time
2017-08-17 15:00:00+02:00  72.38
2017-08-17 15:15:00+02:00  71.00
2017-08-17 15:30:00+02:00  71.67
2017-08-17 16:00:00+02:00  72.80
2017-08-17 16:30:00+02:00  73.00
2017-08-17 17:00:00+02:00  72.50

In [33]:
# these timezone coming from - pytz module 

from pytz import all_timezones        

# print(all_timezones)          # shows all timezone

In [34]:
# mumbai timezone    (same as clacutta)

df = df.tz_convert(tz='Asia/Calcutta')
df

                           Price
Date Time
2017-08-17 18:30:00+05:30  72.38
2017-08-17 18:45:00+05:30  71.00
2017-08-17 19:00:00+05:30  71.67
2017-08-17 19:30:00+05:30  72.80
2017-08-17 20:00:00+05:30  73.00
2017-08-17 20:30:00+05:30  72.50

## ------------------

##### Using  timezone in Date range function

Daterange- uses 2 timezone : pytz and dateutil .                                                                         
1. pytz has all predefined timezone(all_timezones)                # pytz is prefer                                         
2. dateutil use - all timezone available in your os system

In [35]:
rng = pd.date_range(start='1/1/2017',periods=10,freq='H',tz='dateutil/Europe/London')   # dateutil
rng

DatetimeIndex(['2017-01-01 00:00:00+00:00', '2017-01-01 01:00:00+00:00',
               '2017-01-01 02:00:00+00:00', '2017-01-01 03:00:00+00:00',
               '2017-01-01 04:00:00+00:00', '2017-01-01 05:00:00+00:00',
               '2017-01-01 06:00:00+00:00', '2017-01-01 07:00:00+00:00',
               '2017-01-01 08:00:00+00:00', '2017-01-01 09:00:00+00:00'],
              dtype='datetime64[ns, tzfile('GB-Eire')]', freq='H')

###### Arithmetic b/w two timezones

In [36]:
rng = pd.date_range(start='2017-08-22 09:00:00',periods=10, freq='30min')
s = pd.Series(range(10),index=rng) # crating series
s

2017-08-22 09:00:00    0
2017-08-22 09:30:00    1
2017-08-22 10:00:00    2
2017-08-22 10:30:00    3
2017-08-22 11:00:00    4
2017-08-22 11:30:00    5
2017-08-22 12:00:00    6
2017-08-22 12:30:00    7
2017-08-22 13:00:00    8
2017-08-22 13:30:00    9
Freq: 30T, dtype: int64

In [37]:
b = s.tz_localize(tz='Europe/Berlin')    # converting to Berlin 
b

2017-08-22 09:00:00+02:00    0
2017-08-22 09:30:00+02:00    1
2017-08-22 10:00:00+02:00    2
2017-08-22 10:30:00+02:00    3
2017-08-22 11:00:00+02:00    4
2017-08-22 11:30:00+02:00    5
2017-08-22 12:00:00+02:00    6
2017-08-22 12:30:00+02:00    7
2017-08-22 13:00:00+02:00    8
2017-08-22 13:30:00+02:00    9
Freq: 30T, dtype: int64

In [38]:
m = s.tz_localize(tz='Asia/Calcutta') # converting to mumbai(or calcutta)
m

2017-08-22 09:00:00+05:30    0
2017-08-22 09:30:00+05:30    1
2017-08-22 10:00:00+05:30    2
2017-08-22 10:30:00+05:30    3
2017-08-22 11:00:00+05:30    4
2017-08-22 11:30:00+05:30    5
2017-08-22 12:00:00+05:30    6
2017-08-22 12:30:00+05:30    7
2017-08-22 13:00:00+05:30    8
2017-08-22 13:30:00+05:30    9
Freq: 30T, dtype: int64

In [39]:
b + m
    
# it converted both of individual timezone series to unversal cordinated timezone(utc), 
# then perform math(where we got some values : 7 , 9 , 11)    and NaN

2017-08-22 03:30:00+00:00     NaN
2017-08-22 04:00:00+00:00     NaN
2017-08-22 04:30:00+00:00     NaN
2017-08-22 05:00:00+00:00     NaN
2017-08-22 05:30:00+00:00     NaN
2017-08-22 06:00:00+00:00     NaN
2017-08-22 06:30:00+00:00     NaN
2017-08-22 07:00:00+00:00     7.0
2017-08-22 07:30:00+00:00     9.0
2017-08-22 08:00:00+00:00    11.0
2017-08-22 08:30:00+00:00     NaN
2017-08-22 09:00:00+00:00     NaN
2017-08-22 09:30:00+00:00     NaN
2017-08-22 10:00:00+00:00     NaN
2017-08-22 10:30:00+00:00     NaN
2017-08-22 11:00:00+00:00     NaN
2017-08-22 11:30:00+00:00     NaN
Freq: 30T, dtype: float64

## ---------------------------

##   Shifting  and Lagging

In [43]:
import pandas as pd

df = pd.read_csv('stocks_fb.csv',parse_dates=True,index_col='Date')
df.head()

             Price
Date
2017-08-15  171.00
2017-08-16  170.00
2017-08-17  166.91
2017-08-18  167.41
2017-08-21  167.78

In [44]:
df.shift(1).head()    # shift- shift the price by 1 day , Wecan check by plot()

#  to shift up-> use  -> df.shift(-1) 
# shift() -can be used in timeseries also

             Price
Date
2017-08-15     NaN
2017-08-16  171.00
2017-08-17  170.00
2017-08-18  166.91
2017-08-21  167.41

In [45]:
# calculating price change in one day

df['Prev Day Price']=df['Price'].shift(1)
df.head()

             Price  Prev Day Price
Date
2017-08-15  171.00             NaN
2017-08-16  170.00          171.00
2017-08-17  166.91          170.00
2017-08-18  167.41          166.91
2017-08-21  167.78          167.41

In [46]:
df['1 day Change']=df['Price'] - df['Prev Day Price']
df.head()

             Price  Prev Day Price  1 day Change
Date
2017-08-15  171.00             NaN           NaN
2017-08-16  170.00          171.00         -1.00
2017-08-17  166.91          170.00         -3.09
2017-08-18  167.41          166.91          0.50
2017-08-21  167.78          167.41          0.37

In [47]:
# calculating 5 day return   ,    # by shift(5) method we get  prev 5 day data

df['5 day % return'] = df['Price'] - df['Price'].shift(5) *100/df['Price'].shift(5)  
df.head()

             Price  Prev Day Price  1 day Change  5 day % return
Date
2017-08-15  171.00             NaN           NaN             NaN
2017-08-16  170.00          171.00         -1.00             NaN
2017-08-17  166.91          170.00         -3.09             NaN
2017-08-18  167.41          166.91          0.50             NaN
2017-08-21  167.78          167.41          0.37             NaN

##### Now we - shift  Dates instead of our Data points --> tshift()

In [48]:
df = df[['Price']]     # 1st simplify DF with only Price column
df

             Price
Date
2017-08-15  171.00
2017-08-16  170.00
2017-08-17  166.91
2017-08-18  167.41
2017-08-21  167.78
2017-08-22  169.64
2017-08-23  168.71
2017-08-24  167.74
2017-08-25  166.32
2017-08-28  167.24

In [49]:
df.index

DatetimeIndex(['2017-08-15', '2017-08-16', '2017-08-17', '2017-08-18',
               '2017-08-21', '2017-08-22', '2017-08-23', '2017-08-24',
               '2017-08-25', '2017-08-28'],
              dtype='datetime64[ns]', name='Date', freq=None)

In [50]:
df.index = pd.date_range(start='2017-08-15', periods=10, freq='B')
df.index

DatetimeIndex(['2017-08-15', '2017-08-16', '2017-08-17', '2017-08-18',
               '2017-08-21', '2017-08-22', '2017-08-23', '2017-08-24',
               '2017-08-25', '2017-08-28'],
              dtype='datetime64[ns]', freq='B')

In [51]:
df.tshift(1)    # now it will shift Dates not the Price

# tshift(-1)    - same thing for up use (-1)

             Price
2017-08-16  171.00
2017-08-17  170.00
2017-08-18  166.91
2017-08-21  167.41
2017-08-22  167.78
2017-08-23  169.64
2017-08-24  168.71
2017-08-25  167.74
2017-08-28  166.32
2017-08-29  167.24